# document_types.py

DOCUMENT_TYPES = {
    "หนังสือภายนอก": {
        'ที่': '#FF0000',
        'ส่วนราชการ': '#00FF00',
        'วันที่': '#0000FF',
        'เรื่อง': '#FFFF00',
        'เรียน': '#FF00FF',
        'อ้างถึง': '#00FFFF',
        'สิ่งที่ส่งมาด้วย': '#FF8800',
        'เนื้อความ': '#808080',
        'ลงชื่อ': '#008080',
        'ตำแหน่ง': '#800080'
    },
    "หนังสือภายใน": {
        'ส่วนราชการ': '#FF0000',
        'ที่': '#00FF00',
        'วันที่': '#0000FF',
        'เรื่อง': '#FFFF00',
        'เรียน': '#FF00FF',
        'เนื้อความ': '#808080',
        'ลงชื่อ': '#008080',
        'ตำแหน่ง': '#800080'
    },
     "หนังสือประทับตรา": {
        'ที่': '#FF0000',
        'ถึง': '#0000FF',
        'เรื่อง': '#FFFF00',
        'ตราประทับ': '#808080',
        'วันที่': '#008080',
        'เนื้อความ': '#800080'
    }
    # สามารถเพิ่มประเภทอื่น ๆ ได้ เช่น "หนังสือประทับตรา", "คำสั่ง", "ระเบียบ", "ประกาศ"
}
